In [1]:
# following assignment deals with the central tendencies of the given data set

Part 1 : Age,Salary

In [5]:
import pandas as pd
import numpy as np

In [7]:
dataset = pd.read_csv("nba.csv")  
dataset.shape

(457, 9)

In [33]:
# actual = df.describe() # -> these are the results obtained after using the inbuit functions

In [74]:
dataset.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [34]:
# actual

           Number         Age      Weight
count  457.000000  457.000000  457.000000
mean    17.678337   26.938731  221.522976
std     15.966090    4.404016   26.368343
min      0.000000   19.000000  161.000000
25%      5.000000   24.000000  200.000000
50%     13.000000   26.000000  220.000000
75%     25.000000   30.000000  240.000000
max     99.000000   40.000000  307.000000

In [75]:
dataset.isnull().sum()

Name         1
Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College     85
Salary      12
dtype: int64

In [76]:
mode = dataset['College'].mode()[0]
dataset['College'].fillna(mode,inplace=True)

In [77]:
dataset.drop(457 , inplace = True)
dataset

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,Kentucky,5000000.0
...,...,...,...,...,...,...,...,...,...
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,Kentucky,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,Kentucky,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

In [30]:
df['Salary'] = df['Salary'].fillna(df['Salary'].mean)

Mean

In [38]:
arrAge = np.asarray(df['Age'])

arrsize = len(arrAge)

count = 0
for i in arrAge:
    count += i
    i+= 1

meanAge = count / arrsize
print('Mean age according to the dataset is: ',meanAge)


print('The mean using inbuit function is: ', actual.iloc[1][1])

Mean age according to the dataset is:  26.938730853391686
The mean using inbuit function is:  26.938730853391686

Median

In [43]:
np.sort(arrAge)
middle = arrsize / 2
print(int(middle))
print('Median of the dataset is: ' , arrAge[int(middle)])

228
Median of the dataset is:  31.0

Minimum and Maximum

In [49]:
import sys
INT_MIN = sys.maxsize
INT_MAX = -sys.maxsize - 1

for i in arrAge:
    if(i < INT_MIN):
        INT_MIN = i
        
for i in arrAge:import kagglehub

# Download latest version
path = kagglehub.dataset_download("vsharma19/nbacsv" , "" )

print("Path to dataset files:", path)
    if(i > INT_MAX):
        INT_MAX = i
        
print('The maximum value of Age in the dataset is: ', INT_MAX)
print('The minimun value of Age in the dataset is: ', INT_MIN)

The maximum value of Age in the dataset is:  40.0
The minimun value of Age in the dataset is:  19.0

Standard Deviation

In [52]:
squaredValues = [ (i - meanAge) ** 2 for i in arrAge ]
count = 0
for i in squaredValues:
    count += i

variance = count / len(squaredValues) - 1

sd = variance ** 0.5

print('The standard deviation of the data is: ',sd)

The standard deviation of the data is:  4.284030818316623

In [53]:
import matplotlib.pyplot as plt
import seaborn as sns

    Grouping the data based on age

In [61]:
bins = [19 , 25 , 31 , 36 , 40]
labels = ['19 - 24' , '25 - 30' , '31 - 35' , '36 - 40']

df['AgeGroup'] = pd.cut(df['Age'], bins=bins,labels=labels, right=False)

In [67]:
df["AgeGroup"].value_counts()

AgeGroup
25 - 30    212
19 - 24    154
31 - 35     68
36 - 40     20
Name: count, dtype: int64

In [71]:
df['Salary'].dtype

dtype('O')

In [78]:
dataset['AgeGroup'] = pd.cut(dataset['Age'], bins=bins,labels=labels, right=False)

In [79]:
dataset['AgeGroup'].value_counts()

AgeGroup
25 - 30    212
19 - 24    154
31 - 35     68
36 - 40     20
Name: count, dtype: int64

In [80]:
dataset.groupby('AgeGroup')['Salary'].mean()

AgeGroup
19 - 24    2.706212e+06
25 - 30    5.895838e+06
31 - 35    6.662026e+06
36 - 40    3.847918e+06
Name: Salary, dtype: float64

In [81]:
dataset.groupby('AgeGroup')['Salary'].median()

AgeGroup
19 - 24    1654380.0
25 - 30    4000000.0
31 - 35    4500000.0
36 - 40    2814000.0
Name: Salary, dtype: float64

In [83]:
dataset.groupby('AgeGroup')['Salary'].describe()

,count,mean,std,min,25%,50%,75%,max
AgeGroup,,,,,,,,
19 - 24,150.0,2.706212e+06,3.188468e+06,30888.0,960457.0,1654380.0,3095650.0,16407501.0
25 - 30,207.0,5.895838e+06,5.535586e+06,55722.0,1100602.0,4000000.0,9106741.5,22359364.0
31 - 35,67.0,6.662026e+06,6.281446e+06,200600.0,2092835.5,4500000.0,9697402.5,22970500.0
36 - 40,19.0,3.847918e+06,5.516191e+06,222888.0,947276.0,2814000.0,3815259.5,25000000.0

This is part 2 of assignment 3
IRIS